Enterprise_Serivces/Cert/Gold/ChannelECommerceService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/ecommerce/contracts/2010/05/IECommerceService/GetStoreInformation</wsa:Action><wsa:MessageID>uuid:76c7ed7e-dfce-46c8-a097-8fb78f4ef70d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://ecommercechannelqa1.testgs.pvt/ECommerceService.svc</wsa:To></soap:Header><soap:Body><GetStoreInformation xmlns="http://www.gamestop.com/services/channel/ecommerce/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CountryCode xmlns="http://www.gamestop.com/services/channel/ecommerce/messages/2010/08">US</CountryCode><StoreId xmlns="http://www.gamestop.com/services/channel/ecommerce/messages/2010/08">8746</StoreId><StoreNumber xmlns="http://www.gamestop.com/services/channel/ecommerce/messages/2010/08">672</StoreNumber></request></GetStoreInformation></soap:Body></soap:Envelope>